# 处理缺失值

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# 过滤缺失值

## dropna删除包含缺失值的行

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

## 删除所有值均为NA的行

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

## 删除列

In [10]:
data[4] = NA
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

## thresh参数：保留至少有n个非NA数据的行/列

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.058683 -0.705507 -0.787197
1  1.873695  1.235723 -0.893088
2  0.272051 -2.665186 -0.015992
3 -1.043778 -0.496614 -1.614303
4 -0.100852 -1.204395  0.229008
5  1.178751 -1.015315 -0.838662
6 -1.082934  1.453060  0.475703

In [14]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.058683       NaN       NaN
1  1.873695       NaN       NaN
2  0.272051       NaN -0.015992
3 -1.043778       NaN -1.614303
4 -0.100852 -1.204395  0.229008
5  1.178751 -1.015315 -0.838662
6 -1.082934  1.453060  0.475703

In [15]:
df.dropna()

          0         1         2
4 -0.100852 -1.204395  0.229008
5  1.178751 -1.015315 -0.838662
6 -1.082934  1.453060  0.475703

In [16]:
df.dropna(thresh=2)

          0         1         2
2  0.272051       NaN -0.015992
3 -1.043778       NaN -1.614303
4 -0.100852 -1.204395  0.229008
5  1.178751 -1.015315 -0.838662
6 -1.082934  1.453060  0.475703

In [17]:
df.dropna(axis=1,thresh=4)

          0         2
0 -0.058683       NaN
1  1.873695       NaN
2  0.272051 -0.015992
3 -1.043778 -1.614303
4 -0.100852  0.229008
5  1.178751 -0.838662
6 -1.082934  0.475703

# 补全缺失值

In [18]:
df.fillna(0)

          0         1         2
0 -0.058683  0.000000  0.000000
1  1.873695  0.000000  0.000000
2  0.272051  0.000000 -0.015992
3 -1.043778  0.000000 -1.614303
4 -0.100852 -1.204395  0.229008
5  1.178751 -1.015315 -0.838662
6 -1.082934  1.453060  0.475703

In [19]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.058683  0.500000  0.000000
1  1.873695  0.500000  0.000000
2  0.272051  0.500000 -0.015992
3 -1.043778  0.500000 -1.614303
4 -0.100852 -1.204395  0.229008
5  1.178751 -1.015315 -0.838662
6 -1.082934  1.453060  0.475703

In [20]:
df.fillna(0, inplace=True)
# inplace = True 表示修改原对象
df

          0         1         2
0 -0.058683  0.000000  0.000000
1  1.873695  0.000000  0.000000
2  0.272051  0.000000 -0.015992
3 -1.043778  0.000000 -1.614303
4 -0.100852 -1.204395  0.229008
5  1.178751 -1.015315 -0.838662
6 -1.082934  1.453060  0.475703

In [22]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -1.605053 -1.228626 -1.681196
1  1.281147 -1.101390  0.786848
2  0.064971 -0.821944  0.872889
3  1.581832  0.031967  1.321916
4  0.925298 -1.138673  0.588471
5  0.373989  1.079500  1.755471

In [23]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.605053 -1.228626 -1.681196
1  1.281147 -1.101390  0.786848
2  0.064971       NaN  0.872889
3  1.581832       NaN  1.321916
4  0.925298       NaN       NaN
5  0.373989       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0 -1.605053 -1.228626 -1.681196
1  1.281147 -1.101390  0.786848
2  0.064971 -1.101390  0.872889
3  1.581832 -1.101390  1.321916
4  0.925298 -1.101390  1.321916
5  0.373989 -1.101390  1.321916

In [25]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.605053 -1.228626 -1.681196
1  1.281147 -1.101390  0.786848
2  0.064971 -1.101390  0.872889
3  1.581832 -1.101390  1.321916
4  0.925298       NaN  1.321916
5  0.373989       NaN  1.321916

# 数据转换

# 删除重复值

In [26]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated()
# duplicated返回是否与前一行重复的布尔值

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates()
# drop_duplicates删除了与前一行重复的行

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data2 = pd.DataFrame({'k1': ['one', 'two'] * 3 ,
                     'k2': [1, 1, 2, 3, 3, 4],
                     'k3':[1, 1, 2, 3, 3, 4]})
data2

    k1  k2  k3
0  one   1   1
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   3
5  two   4   4

In [33]:
data.duplicated(axis = 0)

TypeError: duplicated() got an unexpected keyword argument 'axis'

In [34]:
data['v1'] = range(7)

In [35]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [37]:
data.drop_duplicates(['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [38]:
data.drop_duplicates(['k1','k2'], keep='last')
# 默认保留第一个重复行，传入参数keep='last'保留最后的重复的行

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [39]:
data.drop_duplicates(['k1','k2'], keep='first')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [41]:
data.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

# 使用函数或映射进行数据转换

In [42]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [43]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
# 创建一个映射关系

In [44]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [45]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

# 替代值

In [46]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# 重命名轴索引

In [51]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [52]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [53]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [56]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [57]:
data.rename(index=str.title, columns=str.upper)
# title()方法会把每个单词的首字母变成大写

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [58]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [59]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# 离散化和分箱

In [60]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [61]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [62]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [63]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [64]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [65]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)
# labels自定义箱名

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [66]:
data = np.random.rand(20)
data

array([0.62505957, 0.17169675, 0.60310954, 0.09021581, 0.92089058,
       0.00486296, 0.04908725, 0.08435182, 0.95052304, 0.74441067,
       0.00816924, 0.12348268, 0.82472306, 0.6484706 , 0.39477133,
       0.54620023, 0.89345315, 0.1920643 , 0.52415966, 0.00329421])

In [68]:
pd.cut(data, 4, precision=4)

[(0.4769, 0.7137], (0.002347, 0.2401], (0.4769, 0.7137], (0.002347, 0.2401], (0.7137, 0.9505], ..., (0.4769, 0.7137], (0.7137, 0.9505], (0.002347, 0.2401], (0.4769, 0.7137], (0.002347, 0.2401]]
Length: 20
Categories (4, interval[float64]): [(0.002347, 0.2401] < (0.2401, 0.4769] < (0.4769, 0.7137] < (0.7137, 0.9505]]

In [69]:
data = np.random.randn(1000)  
cats = pd.qcut(data, 4)  
# qcut基于样本分位数分箱，获得等长的箱
cats

[(-3.287, -0.614], (0.0876, 0.765], (0.765, 3.413], (-0.614, 0.0876], (-0.614, 0.0876], ..., (-0.614, 0.0876], (0.0876, 0.765], (-3.287, -0.614], (0.0876, 0.765], (0.0876, 0.765]]
Length: 1000
Categories (4, interval[float64]): [(-3.287, -0.614] < (-0.614, 0.0876] < (0.0876, 0.765] < (0.765, 3.413]]

In [71]:
pd.value_counts(cats)

(0.765, 3.413]      250
(0.0876, 0.765]     250
(-0.614, 0.0876]    250
(-3.287, -0.614]    250
dtype: int64

In [75]:
cut_data = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
cut_data

[(-1.28, 0.0876], (0.0876, 1.382], (1.382, 3.413], (-1.28, 0.0876], (-1.28, 0.0876], ..., (-1.28, 0.0876], (0.0876, 1.382], (-3.287, -1.28], (0.0876, 1.382], (0.0876, 1.382]]
Length: 1000
Categories (4, interval[float64]): [(-3.287, -1.28] < (-1.28, 0.0876] < (0.0876, 1.382] < (1.382, 3.413]]

In [76]:
pd.value_counts(cut_data)

(0.0876, 1.382]    400
(-1.28, 0.0876]    400
(1.382, 3.413]     100
(-3.287, -1.28]    100
dtype: int64

# 检测和过滤异常值

In [128]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025619    -0.002790    -0.069612     0.065019
std       1.006798     0.996797     0.996400     0.991650
min      -3.184377    -3.745356    -3.428254    -3.548824
25%      -0.641675    -0.644144    -0.774890    -0.596286
50%       0.002073    -0.014664    -0.117489     0.094503
75%       0.680391     0.654328     0.611729     0.777558
max       3.260383     3.927528     3.366626     2.653656

In [129]:
col = data[2]
col[np.abs(col) > 3]

520   -3.428254
897    3.366626
Name: 2, dtype: float64

In [134]:
data > 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3     True  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [135]:
(data > 3).any(0)

0     True
1     True
2     True
3    False
dtype: bool

In [136]:
(data > 3).any(1)

0      False
1      False
2      False
3       True
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [99]:
data[np.abs(data) > 3] = np.sign(data) * 3
pd.options.display.max_rows = 10
data

            0         1         2         3
0    1.104680 -0.415066 -0.123528  1.180617
1   -2.138348 -0.588937  0.305805 -0.579139
2    0.193382  0.165594  0.917549  0.887212
3    1.173595 -0.519360 -0.966727 -0.648737
4    1.763710 -0.357274  2.431209 -0.575372
..        ...       ...       ...       ...
995 -0.696984  0.010249  0.960546 -2.367364
996 -0.157068  0.257329  0.065933  1.128360
997  0.163603  0.979498  2.271267 -1.413745
998 -1.030536  0.865513 -1.082529 -0.515770
999 -3.000000 -0.599275  0.355489 -0.655381

[1000 rows x 4 columns]

In [104]:
data = pd.DataFrame(np.random.randn(1000, 4))
data[np.abs(data) > 3] = np.sign(data) * 3
# np.sign(data)根据数据中的值的正负分别生成1和-的数值
data

            0         1         2         3
0    1.489653  1.111671 -0.120809 -1.210361
1    1.157831  1.370275 -1.178407  1.165392
2    0.411904 -0.062282 -1.397316 -0.043455
3   -1.319459 -0.328658  1.493603 -1.101173
4    0.957992  0.778340 -0.551830  0.664245
..        ...       ...       ...       ...
995 -0.697233  0.433037  0.439587 -0.037397
996 -1.729403 -0.542877 -0.508342 -0.780832
997 -1.687214  1.450010 -0.050019  1.113290
998 -1.205121 -0.144306 -0.758117  0.995965
999  1.768577  0.987492  1.556951  0.001394

[1000 rows x 4 columns]

# 置换和随机取样

In [106]:
sampler = np.random.permutation(5)
sampler

array([0, 1, 2, 4, 3])

In [108]:
df = pd.DataFrame(np.arange(20).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [109]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

In [110]:
df.sample(n=3)
# .sample()方法，随机抽取n行

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [113]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [114]:
draws = choices.sample(n=10, replace=True)
draws

2   -1
2   -1
4    4
0    5
1    7
0    5
1    7
2   -1
1    7
1    7
dtype: int64

# 计算指标/虚拟变量

In [115]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [120]:
pd.get_dummies(df.key)
# get_dummies将值转换为0/1值

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [119]:
dummies = pd.get_dummies(df['key'], prefix='key')
# prefix为前缀参数
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [121]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## get_dummies与cut结合使用

In [122]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [123]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 字符串操作

# 字符串对象方法

In [137]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [138]:
pieces = [x.strip() for x in val.split(',')]
pieces
# strip清除空格

['a', 'b', 'guido']

In [139]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [140]:
'::'.join(pieces)

'a::b::guido'

In [141]:
'guido' in val

True

In [142]:
val.index(',')

1

In [143]:
val.find(':')

-1

In [144]:
val.index(':')

ValueError: substring not found

In [145]:
val.count(',')

2

In [146]:
val.replace(',', '::')

'a::b::  guido'

In [147]:
val.replace(',', '')

'ab  guido'

# 正则表达式

In [148]:
import re

In [149]:
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [151]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [152]:
regex.findall(text)

['    ', '\t ', '  \t']

In [153]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [154]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [155]:
m = regex.search(text)
m

In [156]:
text[m.start():m.end()]

'dave@google.com'

In [157]:
print(regex.match(text))

None

In [158]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [159]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [160]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [161]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [162]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

# 向量化字符串函数

In [163]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [164]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [165]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [166]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [167]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [168]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [169]:
matches.str.get(1)

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [170]:
data.str.get(1)

Dave       a
Rob        o
Steve      t
Wes      NaN
dtype: object

In [173]:
data.str[1]

Dave       a
Rob        o
Steve      t
Wes      NaN
dtype: object

In [171]:
data.str[0]

Dave       d
Rob        r
Steve      s
Wes      NaN
dtype: object

In [172]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object